In [1]:
import pandas as pd

In [9]:
my_series = pd.Series([4, 7, -5, 3, -1])
my_series

0    4
1    7
2   -5
3    3
4   -1
dtype: int64

In [10]:
my_series[1]

7

In [11]:
my_series[2:5]

2   -5
3    3
4   -1
dtype: int64

In [12]:
my_series[my_series > 0]

0    4
1    7
3    3
dtype: int64

In [13]:
my_series * 3

0    12
1    21
2   -15
3     9
4    -3
dtype: int64

In [14]:
import numpy as np

In [17]:
np.exp(my_series)

0      54.598150
1    1096.633158
2       0.006738
3      20.085537
4       0.367879
dtype: float64

In [18]:
np.sum(my_series)

8

In [27]:
df = pd.DataFrame({
    'name': ['Маша', 'Вася', 'Эдуард'],
    'age': [25, 8, 48],
    'job': ['Программист', 'Школьник', 'Big Boss'],
    'salary': [100, 10, 200]
}, index=['some', 'random', 'words'])
df

          name  age          job  salary
some      Маша   25  Программист     100
random    Вася    8     Школьник      10
words   Эдуард   48     Big Boss     200

In [20]:
name = df['name']
name

0      Маша
1      Вася
2    Эдуард
Name: name, dtype: object

In [22]:
df[df['salary'] >= 100]

     name  age          job  salary
0    Маша   25  Программист     100
2  Эдуард   48     Big Boss     200

In [29]:
df['salary'] *= 10
df

          name  age          job  salary
some      Маша   25  Программист    1000
random    Вася    8     Школьник     100
words   Эдуард   48     Big Boss    2000

In [39]:
df.T.loc['name']

some        Маша
random      Вася
words     Эдуард
Name: name, dtype: object

In [40]:
df.loc['some']

name             Маша
age                25
job       Программист
salary           1000
Name: some, dtype: object

In [41]:
df.loc[::]

          name  age          job  salary
some      Маша   25  Программист    1000
random    Вася    8     Школьник     100
words   Эдуард   48     Big Boss    2000

In [42]:
df.iloc[1]

name          Вася
age              8
job       Школьник
salary         100
Name: random, dtype: object

In [43]:
df.iloc[:1]

      name  age          job  salary
some  Маша   25  Программист    1000